cmsis-svd/cmsis-svd/data/NXP/LPC1102_04.svd
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>SSP0CLKDIV</name>										
		<description>SPI0 clock divder</description>										
		<addressOffset>0x094</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>DIV</name>								
				<description>SPI0_PCLK clock divider values 0: Disable SPI0_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>								
				<bitRange>[7:0]</bitRange>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:8]</bitRange>								
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>UARTCLKDIV</name>										
		<description>UART clock divder</description>										
		<addressOffset>0x098</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>DIV</name>								
				<description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255.</description>								
				<bitRange>[7:0]</bitRange>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:8]</bitRange>								
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>WDTCLKSEL</name>										
		<description>WDT clock source select</description>										
		<addressOffset>0x0D0</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>SEL</name>								
				<description>WDT clock source</description>								
				<bitRange>[1:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>IRC_OSCILLATOR</name>						
						<description>IRC oscillator</description>						
						<value>0x0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>MAIN_CLOCK</name>						
						<description>Main clock</description>						
						<value>0x1</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WATCHDOG_OSCILLATOR</name>						
						<description>Watchdog oscillator</description>						
						<value>0x2</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RESERVED</name>						
						<description>Reserved</description>						
						<value>0x3</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:2]</bitRange>								
											
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>WDTCLKUEN</name>										
		<description>WDT clock source update enable</description>										
		<addressOffset>0x0D4</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>ENA</name>								
				<description>Enable WDT clock source update</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_CHANGE</name>						
						<description>No change</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>UPDATE_CLOCK_SOURCE</name>						
						<description>Update clock source</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:1]</bitRange>								
											
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>WDTCLKDIV</name>										
		<description>WDT clock divider</description>										
		<addressOffset>0x0D8</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>DIV</name>								
				<description>WDT clock divider values 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255.</description>								
				<bitRange>[7:0]</bitRange>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:8]</bitRange>								
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>CLKOUTCLKSEL</name>										
		<description>CLKOUT clock source select</description>										
		<addressOffset>0x0E0</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>SEL</name>								
				<description>CLKOUT clock source</description>								
				<bitRange>[1:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>IRC_OSCILLATOR</name>						
						<description>IRC oscillator</description>						
						<value>0x0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>SYSTEM_OSCILLATOR</name>						
						<description>System oscillator</description>						
						<value>0x1</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WATCHDOG_OSCILLATOR</name>						
						<description>Watchdog oscillator</description>						
						<value>0x2</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>MAIN_CLOCK</name>						
						<description>Main clock</description>						
						<value>0x3</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:2]</bitRange>								
											
