cmsis-svd/cmsis-svd/data/NXP/LPC1102_04.svd
			<register>
				<name>IE</name>
				<description>Interrupt mask register for port n</description>
				<addressOffset>0x8010</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = Interrupt on pin PIOn_x is masked. 1 = Interrupt on pin PIOn_x is not masked.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>RIS</name>
				<description>Raw interrupt status register for port n</description>
				<addressOffset>0x8014</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RAWST0</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RAWST1</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RAWST2</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RAWST3</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RAWST4</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RAWST5</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RAWST6</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RAWST7</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RAWST8</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>RAWST9</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>RAWST10</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>RAWST11</name>
						<description>Raw interrupt status (x = 0 to 11). 0 = No interrupt on pin PIOn_x. 1 = Interrupt requirements met on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>MIS</name>
				<description>Masked interrupt status register for port n</description>
				<addressOffset>0x8018</addressOffset>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MASK0</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>MASK1</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK2</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>MASK3</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK4</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>MASK5</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>MASK6</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>MASK7</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>MASK8</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>MASK9</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>MASK10</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK11</name>
						<description>Selects interrupt on pin x to be masked (x = 0 to 11). 0 = No interrupt or interrupt masked on pin PIOn_x. 1 = Interrupt on PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>IC</name>
				<description>Interrupt clear register for port n</description>
				<addressOffset>0x801C</addressOffset>
				<access>write-only</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>CLR0</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>CLR1</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>CLR2</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>CLR3</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>CLR4</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>CLR5</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>CLR6</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>CLR7</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>CLR8</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>CLR9</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[9:9]</bitRange>
					</field>
					<field>
						<name>CLR10</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>CLR11</name>
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:12]</bitRange>
					</field>
				</fields>
			</register>
